content/post/analysis_recent_election.md
+++
title = "Analysis of a recent election"
author = ["Alasdair McAndrew"]
date = 2017-12-07
draft = false
mathjax = true
+++

On November 18, 2017, a by-election was held in my suburb of
[Northcote](https://en.wikipedia.org/wiki/Northcote,%5FVictoria), on
account of the death by cancer of the sitting member. It turned into a
two-way contest between Labor (who had held the seat since its inception
in 1927), and the Greens, who are making big inroads into the inner
city. The Greens candidate won, much to Labor's surprise. As I played a
small part in this election, I had some interest in its result. And so I
thought I'd experiment with the results and see how close the result
was, and what other voting systems might have produced.

In Australia, the voting method used for almost all lower house
elections (state and federal), is
[Instant Runoff
Voting](https://en.wikipedia.org/wiki/Instant-runoff%5Fvoting), also known as the Alternative Vote, and known locally as the
"preferential method". Each voter must number the candidates
sequentially starting from 1. All boxes must be filled in (except the
last); no numbers can be repeated or missed. In Northcote there were 12
candidates, and so each voter had to number the boxes from 1 to 12 (or 1
to 11); any vote without those numbers is invalid and can't be counted.
Such votes are known as "informal". Ballots are distributed according to
first preferences. If no candidate has obtained an absolute majority,
then the candidate with the lowest count is eliminated, and all those
ballots distributed according to their second preferences. This
continues through as many redistributions as necessary until one
candidate ends up with an absolute majority of ballots. So at any stage
the candidate with the lowest number of ballots is eliminated, and those
ballots redistributed to the remaining candidates on the basis of the
highest preferences. As voting systems go it's not the worst, although
it has many faults. However, it is too entrenched in Australian
political life for change to be likely.

Each candidate had prepared a
[How to Vote card](https://en.wikipedia.org/wiki/How-to-vote%5Fcard),
listing the order of candidates they saw as being most likely to ensure
a good result for themselves. In fact there is no requirement for any
voter to follow a How to Vote card, but most voters do. For this reason
the ordering of candidates on these cards is taken very seriously, and
one of the less savoury aspects of Australian politics is backroom
"preference deals", where parties will wheel and deal to ensure best
possible preference positions on other How to Vote cards.

Here are the 12 candidates and their political parties, in the order as
listed on the ballots:

Attention: The internal data of table "4" is corrupted!

For this election the How to Vote cards can be seen at the
[ABC
news site](http://www.abc.net.au/news/elections/northcote-by-election-2017/). The only candidate not to provide a full ordered list was
Joseph Toscano, who simple advised people to number his square 1, and
the other squares in any order they liked, along with a recommendation
for people to number Lidia Thorpe 2.

As I don't have a complete list of all possible ballots with their
orderings and numbers, I'm going to make the following assumptions:

1.  Every voter followed the How to Vote card of their preferred
    candidate exactly.
2.  Joseph Toscano's preference ordering is: 3,4,2,5,6,7,8,9,1,10,11,12
    (This gives Toscano 1; Thorpe 2; and puts the numbers 3 -- 12 in
    order in the remaining spaces).

These assumptions are necessarily crude, and don't reflect the nuances
of the election. But as we'll see they end up providing a remarkably
close fit with the final results.

For the exploration of the voting data I'll use Python, and so here is
all the How to Vote information as a dictionary:

```python
In [ ]: htv = dict()
	htv['Hayward']=[1,10,7,6,8,5,12,11,3,2,4,9]
	htv['Sanaghan']=[3,1,2,5,6,7,8,9,10,11,12,4]
	htv['Thorpe']=[6,9,1,3,10,8,12,2,7,4,5,11]
	htv['Lenk']=[7,8,3,1,5,11,12,2,9,4,6,10]
	htv['Chipp']=[10,12,4,5,1,6,7,3,11,9,2,8]
	htv['Cooper']=[5,12,8,6,2,1,7,3,11,9,10,4]
	htv['Rossiter']=[6,12,9,11,2,7,1,5,8,10,3,4]
	htv['Burns']=[10,12,5,3,2,4,6,1,11,9,8,7]
	htv['Toscano']=[3,4,2,5,6,7,8,9,1,10,11,12]
	htv['Edwards']=[2,10,4,3,8,9,12,6,5,1,7,11]
	htv['Spirovska']=[2,12,3,7,4,5,6,8,10,9,1,11]
	htv['Fontana']=[2,3,4,5,6,7,8,9,10,11,12,1]

	In [ ]: cands = list(htv.keys())
```

voting took place at different voting centres (also known as "booths"),
and the first preferences for each candidate at each booth can be found
at the
[Victorian
Electoral Commission](https://www.vec.vic.gov.au/Results/State2017/FPVbyVotingCentreNorthcoteDistrict.html). I copied this information into a spreadsheet and
saved it as a CSV file. I then used the data analysis library
[pandas](https://pandas.pydata.org) to read it in as a
[DataFrame](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html):

```python
In [ ]: import pandas as pd
	firstprefs = pd.read_csv('northcote_results.csv')
	firsts = firstprefs.loc[:,'Hayward':'Fontana'].sum(axis=0)
	firsts

Out[ ]:
Hayward        354
Sanaghan       208
Thorpe       16254
Lenk           770
Chipp         1149
Cooper         433
Rossiter      1493
Burns        12721
Toscano        329
Edwards        154
Spirovska      214
Fontana       1857
dtype: int64
```

As Thorpe has more votes than any other candidate, then by the voting
system of simple plurality (or
[First Past
The Post](https://en.wikipedia.org/wiki/First-past-the-post%5Fvoting)) she would win. This system is used in the USA, and is
possibly the worst of all systems for more than two candidates.
