content/post/analysis_recent_election.md


## Checking IRV {#checking-irv}

So let's first check how IRV works, with a little program that starts
with a dictionary and first preferences of each candidate. Recall our
simplifying assumption that all voters vote according to the How to Vote
cards, which means that when a candidate is eliminated, all those votes
will go to just one other remaining candidate. In practice, of course,
those ballots would be redistributed across a number of candidates.

Here's a simple program to manage this version of IRV:

```python
def IRV(votes):
    # performs an IRV simulation on a list of first preferences: at each stage
    # deleting the candidate with the lowest current score, and distributing
    # that candidates votes to the highest remaining candidate
    vote_counts = votes.copy()
    for i in range(10):
	m = min(vote_counts.items(), key = lambda x: x[1])
	ind = next(j for j in range(2,11) if cands[htv[m[0]].index(j)] in vote_counts)
	c = cands[htv[m[0]].index(ind)]
	vote_counts += m[1]
	del(vote_counts[m[0]])
    return(vote_counts)
```

We could make this code a little more efficient by stopping when any
candidate has amassed over 50% pf the votes. But for simplicity we'll
eliminate 10 of the 12 candidates, so it will be perfectly clear who has
won. Let's try it out:

```python
In [ ]: IRV(firsts)
  Out[ ]:
  Thorpe    18648
  Burns     17288
  dtype: int64
```

Note that this is very close to the results listed on the VEC site:

```python
Thorpe:    18380
Burns:     14410
Fontana:   3298
```

At this stage it doesn't matter where Fontana's votes go (in fact they
would go to Burns), as Thorpe already has a majority. But the result we
obtained above with our simplifying assumptions gives very similar
values.

Now lets see what happens if we work through each booth independently:

```python
In [ ]: finals = {'Thorpe':0,'Burns':0}

In [ ]: for i in firstprefs.index:
   ...:     booth = dict(firstprefs.loc[i,'Hayward':'Fontana'])
   ...:     f = IRV(booth)
   ...:     finals['Thorpe'] += f['Thorpe']
   ...:     finals['Burns'] += f['Burns']
   ...:     print(firstprefs.loc[i,'Booth'],': ',f)
   ...:
Alphington :  {'Thorpe': 524, 'Burns': 545}
Alphington North :  {'Thorpe': 408, 'Burns': 485}
Bell :  {'Thorpe': 1263, 'Burns': 893}
Croxton :  {'Thorpe': 950, 'Burns': 668}
Darebin Parklands :  {'Thorpe': 180, 'Burns': 204}
Fairfield :  {'Thorpe': 925, 'Burns': 742}
Northcote :  {'Thorpe': 1043, 'Burns': 875}
Northcote North :  {'Thorpe': 1044, 'Burns': 1012}
Northcote South :  {'Thorpe': 1392, 'Burns': 1137}
Preston South :  {'Thorpe': 677, 'Burns': 639}
Thornbury :  {'Thorpe': 1158, 'Burns': 864}
Thornbury East :  {'Thorpe': 1052, 'Burns': 804}
Thornbury South :  {'Thorpe': 1310, 'Burns': 1052}
Westgarth :  {'Thorpe': 969, 'Burns': 536}
Postal Votes :  {'Thorpe': 1509, 'Burns': 2262}
Early Votes :  {'Thorpe': 5282, 'Burns': 3532}

In [ ]: finals
Out[ ]: {'Burns': 16250, 'Thorpe': 19686}
```

Note again that the results are surprisingly close to the
"[two-party
preferred](https://www.vec.vic.gov.au/Results/State2017/TCPbyVotingCentreNorthcoteDistrict.html)" results as reported again on the VEC site. This adds weight
to the notion that our assumptions, although crude, do in fact provide a
reasonable way of experimenting with the election results.


## Borda counts {#borda-counts}

These are named for
[Jean Charles de
Borda](https://en.wikipedia.org/wiki/Jean-Charles%5Fde%5FBorda) (1733 -- 1799) an early voting theorist. The idea is to weight
all the preferences, so that a preference of 1 has a higher weighting
that a preference of 2, and so on. All the weights are added, and the
candidate with the greatest total is deemed to be the winner. With
candidates, there are different methods of determining weighting;
probably the most popular is a simple linear weighting, so that a
preference of is weighted as . This gives weightings from down to zero.
Alternatively a weighting of can be used, which gives weights of down to

1.  Both are equivalent in determining a winner. Another possible

weighting is .

Here's a program to compute Borda counts, again with our simplification:

```python
def borda(x): # x is 0 or 1
    borda_count = dict()
    for c in cands:
	borda_count=0.0
    for c in cands:
	v = firsts  #  number of 1st pref votes for candidate c
	for i in range(1,13):
	    appr = cands[htv.index(i)]  # the candidate against position i on c htv card
	    if x==0:
		borda_count[appr] += v/i
	    else:
		borda_count[appr] += v*(11-i)
    if x==0:
	for k, val in borda_count.items():
	    borda_count[k] = float("{:.2f}".format(val))
    else:
	for k, val in borda_count.items():
	    borda_count[k] = int(val)
    return(borda_count)
```

Now we can run this, and to make our lives easier we'll sort the
results:

```python
In [ ]: sorted(borda(1).items(), key = lambda x: x[1], reverse = True)
Out[ ]:
[('Burns', 308240),
 ('Thorpe', 279392),
 ('Lenk', 266781),
 ('Chipp', 179179),
 ('Cooper', 167148),
 ('Spirovska', 165424),
 ('Edwards', 154750),
 ('Hayward', 136144),
 ('Fontana', 88988),
 ('Toscano', 80360),
 ('Rossiter', 75583),
 ('Sanaghan', 38555)]

In [ ]: sorted(borda(0).items(), key = lambda x: x[1], reverse = True)
Out[ ]:
[('Burns', 22409.53),
 ('Thorpe', 20455.29),
 ('Lenk', 11485.73),
 ('Chipp', 10767.9),
 ('Spirovska', 6611.22),
 ('Cooper', 6592.5),
 ('Edwards', 6569.93),
 ('Hayward', 6186.93),
 ('Fontana', 6006.25),
 ('Rossiter', 5635.08),
 ('Toscano', 4600.15),
 ('Sanaghan', 4196.47)]
```

Note that in both cases Burns has the highest output. This is in general
to be expected of Borda counts: that the highest value does not
necessarily correspond to the candidate which is seen as better overall.
For this reason Borda counts are rarely used in modern systems, although
they can be used to give a general picture of an electorate.
