content-org/blog_posts.org
*** Condorcet criteria
    :PROPERTIES:
    :CUSTOM_ID: condorcet-criteria
    :END:

There are a vast number of voting systems which treat the vote as
simultaneous pairwise contests. For example in a three way contest,
between Alice, Bob, and Charlie the system considers the contest between
Alice and Bob, between Alice and Charlie, and between Bob and Charlie.
Each of these contests will produce a winner, and the outcome of all the
pairwise contests is used to determine the overall winner. If there is a
single person who is preferred, by a majority of voters, in each of
their pairwise contests, then that person is called a /Condorcet
winner/. This is named for the
[[https://en.wikipedia.org/wiki/Marquis_de_Condorcet][Marquis de
Condorcet]] (1743 -- 1794) another early voting theorist. The /Condorcet
criterion/ is one of many criteria considered appropriate for a voting
system; it says that if the ballots return a Condorcet winner, then that
winner should be chosen by the system. This is one of the faults of IRV:
that it does not necessarily return a Condorcet winner.

Let's look again at the How to Vote preferences, and the numbers of
voters of each:

#+BEGIN_SRC
  In [ ]: htvd = pd.DataFrame(list(htv.values()),index=htv.keys(),columns=htv.keys()).transpose()
  In [ ]: htvd.loc['Firsts']=list(firsts.values)
  In [ ]: htvd

  Out[ ]: 
             Hayward  Sanaghan  Thorpe  Lenk  Chipp  Cooper  Rossiter  Burns  Toscano  Edwards  Spirovska  Fontana
  Hayward          1         3       6     7     10       5         6     10        3        2          2        2
  Sanaghan        10         1       9     8     12      12        12     12        4       10         12        3
  Thorpe           7         2       1     3      4       8         9      5        2        4          3        4
  Lenk             6         5       3     1      5       6        11      3        5        3          7        5
  Chipp            8         6      10     5      1       2         2      2        6        8          4        6
  Cooper           5         7       8    11      6       1         7      4        7        9          5        7
  Rossiter        12         8      12    12      7       7         1      6        8       12          6        8
  Burns           11         9       2     2      3       3         5      1        9        6          8        9
  Toscano          3        10       7     9     11      11         8     11        1        5         10       10
  Edwards          2        11       4     4      9       9        10      9       10        1          9       11
  Spirovska        4        12       5     6      2      10         3      8       11        7          1       12
  Fontana          9         4      11    10      8       4         4      7       12       11         11        1
  Firsts         354       208   16254   770   1149     433      1493  12721      329      154        214     1857
#+END_SRC

Here the how to vote information is in the columns. If we look at just
the first two candidates, we see that Hayward is preferred to Sanaghan
by all voters except for those who voted for Sanaghan. Thus a majority
(in fact, nearly all) voters preferred Hayward to Sanaghan.

For each pair of candidates, the number of voters preferring one to the
other can be computed by this program:

#+BEGIN_SRC python
  def condorcet():
      condorcet_table = pd.DataFrame(columns=cands,index=cands).fillna(0)
      for c in cands:
          hc = htv
          for i in range(12):
              for j in range(12):
                  if hc[i] &lt; hc[j]:
                      condorcet_table.loc[cands[i],cands[j]] += firsts
      return(condorcet_table)
#+END_SRC

We can see the results of this program:

#+BEGIN_SRC python
  In [ ]: ct = condorcet(); ct
  Out[ ]: 
             Hayward  Sanaghan  Thorpe   Lenk  Chipp  Cooper  Rossiter  Burns  Toscano  Edwards  Spirovska  Fontana
  Hayward          0     35728    4505   5042  19370   21633     20573   3116    35607     4888       3335    18283
  Sanaghan       208         0    2065   2394  18648    3164     19926   2748     2835     2394       2394    17715
  Thorpe       31431     33871       0  21504  20140   20935     34010  19370    33760    35428      32726    32153
  Lenk         30894     33542   14432      0  19926   33442     34229   3886    33760    33935      32726    31945
  Chipp        16566     17288   15796  16010      0   18895     34443   6037    18845    18404      18960    33871
  Cooper       14303     32772   15001   2494  17041       0     34443   3395    18075    18404      15548    31608
  Rossiter     15363     16010    1926   1707   1493    1493         0   4101    18075    18404      17041    15906
  Burns        32820     33188   16566  32050  29899   32541     31835      0    35099    35428      32726    32024
  Toscano        329     33101    2176   2176  17091   17861     17861    837        0     3887       2902    18075
  Edwards      31048     33542     508   2001  17532   17532     17532    508    32049        0      20359    18075
  Spirovska    32601     33542    3210   3210  16976   20388     18895   3210    33034    15577          0    20717
  Fontana      17653     18221    3783   3991   2065    4328     20030   3912    17861    17861      15219        0
#+END_SRC

What we want to see, of course, if anybody has obtained a majority of
preferences against everybody else. To do this we can find all the
values greater than the majority, and add up their number. A value of 11
indicates a Condorcet winner:

#+BEGIN_SRC python
  In [ ]: maj = firsts.sum()//2 + 1; maj
  Out[ ]: 17969

  In [ ]: ((ct &gt;= maj)*1).sum(axis = 1)
  Out[ ]: 
  Hayward       6.0
  Sanaghan      2.0
  Thorpe       11.0
  Lenk          9.0
  Chipp         6.0
  Cooper        5.0
  Rossiter      2.0
  Burns        10.0
  Toscano       2.0
  Edwards       5.0
  Spirovska     6.0
  Fontana       2.0
  dtype: float64
#+END_SRC

So in this case we do indeed have a Condorcet winner in Thorpe, and this
election (at least with our simplifying assumptions) is also one in
which IRV returned the Condorcet winner.

